# Brewfile for macOS package management
# Use with: brew bundle

# Core utilities
brew "coreutils"
brew "curl"
brew "wget"
brew "rsync"
brew "unzip"
brew "tree"
brew "pwgen"

# Development tools
brew "git"
brew "git-delta"
brew "gh"
brew "cmake"
brew "ninja"
brew "ctags"
brew "pkg-config"

# Programming languages and build dependencies
brew "python"
brew "node"
brew "go"
brew "lua"
brew "luajit"
brew "lua-language-server"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Version managers
brew "nvm"
brew "pyenv"
brew "pyenv-virtualenv"

# Text editors and terminal tools
brew "neovim"
brew "vim"
brew "tmux"
brew "byobu"
brew "gitmux"  # Git status for tmux/byobu

# Modern CLI tools
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "direnv"
brew "emojify"

# Shell enhancements
brew "zsh"
brew "bash-completion"
brew "zsh-completions"
brew "zplug"
brew "zimfw"

# macOS specific tools
brew "mas"  # Mac App Store CLI

# GUI applications (Cask)
cask "rectangle"  # Window management
cask "karabiner-elements"  # Keyboard customization
cask "flameshot"  # Screenshot tool
cask "hammerspoon"  # macOS automation
cask "vlc"  # Media player
cask "rar"  # RAR archive utility
cask "xquartz"  # X11 for macOS

# Fonts (Cask)
cask "font-fantasque-sans-mono-nerd-font"  # Nerd Font
cask "font-hack-nerd-font"  # Nerd Font
